#+TITLE: AWS Services Overview
#+PROPERTY: header-args :results output :exports both

*** List Instances
#+BEGIN_SRC shell
  aws ec2 describe-instances | jq -r '.Reservations[].Instances[].InstanceId'
#+END_SRC

#+RESULTS:
| i-09a85540250dd5f7f |
| i-0b6b20ba6db18df32 |
| i-09ce4c8ebcfcff4cf |

*** List Volumes
#+BEGIN_SRC shell
  aws ec2 describe-volumes | jq -r '.Volumes[].VolumeId'
#+END_SRC

#+RESULTS:
| vol-0e042966ec7cfd553 |
| vol-010145d8448cad2a4 |
| vol-0e1e871141f867720 |

*** List VPCs
#+BEGIN_SRC shell
  aws ec2 describe-vpcs | jq -r '.Vpcs[].VpcId'
#+END_SRC

#+RESULTS:
| vpc-0217a5e9b879a8c13 |
| vpc-f0fc4e8a          |

*** List Buckets
#+BEGIN_SRC shell
  aws s3 ls | grep aif
#+END_SRC

#+RESULTS:
| 2024-09-04 | 08:56:23 | aif-c01            |
| 2024-09-17 | 12:39:43 | aif-c01-input      |
| 2024-09-04 | 19:20:17 | aif-c01-jasonwalsh |
| 2024-09-04 | 19:18:18 | aif-c01-jwalsh     |
| 2024-09-17 | 12:39:44 | aif-c01-output     |

*** List Buckets (API)
#+BEGIN_SRC shell
  aws s3api list-buckets | jq -r '.Buckets[].Name | select(startswith("aif") or startswith("mla"))'
#+END_SRC

#+RESULTS:
| aif-c01            |
| aif-c01-input      |
| aif-c01-jasonwalsh |
| aif-c01-jwalsh     |
| aif-c01-output     |

*** List Users
#+BEGIN_SRC shell
  aws iam list-users | jq -r '.Users[].UserName'
#+END_SRC

#+RESULTS:
| dev    |
| jwalsh |
| prod   |
| qat    |

*** List Roles
#+BEGIN_SRC shell
aws iam list-roles | jq -r '.Roles[].RoleName | select(
    startswith("aif-c01") or
    startswith("mla-") or
    contains("SageMaker") or
    contains("Bedrock") or
    contains("Comprehend") or
    contains("Translate") or
    contains("DeepLens") or
    contains("RoboMaker") or
    contains("MLWorkflow") or
    contains("MLOps")
)'
#+END_SRC

#+RESULTS:
| A2ISageMaker-ExecutionRole-20240911T190545                       |
| aif-c01-batch-role                                               |
| aif-c01-bedrock-cloudwatch                                       |
| AmazonBedrockExecutionRoleForAgentFlowEval                       |
| AmazonBedrockExecutionRoleForAgents_6TYTN6S0PBE                  |
| AmazonBedrockExecutionRoleForAgents_9RZ7WT2H7L9                  |
| AmazonBedrockExecutionRoleForAgents_B2K8YVKZT9O                  |
| AmazonBedrockExecutionRoleForAgents_G43OC4197X                   |
| AmazonBedrockExecutionRoleForAgents_GJS4XAN7EQK                  |
| AmazonBedrockExecutionRoleForAgents_IQYJI0VJ819                  |
| AmazonBedrockExecutionRoleForAgents_JH1R5YCMQ                    |
| AmazonBedrockExecutionRoleForAgents_JPXMYT1RME                   |
| AmazonBedrockExecutionRoleForAgents_OENM3J46LQF                  |
| AmazonBedrockExecutionRoleForAgents_OYF0TFY67C9                  |
| AmazonBedrockExecutionRoleForAgents_ROL4TVUQ6ZK                  |
| AmazonBedrockExecutionRoleForAgents_RQG76BFYU0Q                  |
| AmazonBedrockExecutionRoleForAgents_YE04U6EGG7E                  |
| AmazonBedrockExecutionRoleForFlows_81RENNE1Y5                    |
| AmazonBedrockExecutionRoleForFlows_BIZVT5E45B                    |
| AmazonBedrockExecutionRoleForKnowledgeBase_0odwt                 |
| AmazonBedrockExecutionRoleForKnowledgeBase_4uy41                 |
| AmazonBedrockExecutionRoleForKnowledgeBase_ci1wt                 |
| AmazonBedrockExecutionRoleForKnowledgeBase_fatg9                 |
| AmazonComprehendServiceRole-aif-cio                              |
| AmazonComprehendServiceRole-aif-cio-outputer                     |
| AmazonComprehendServiceRole-aif-cio-outputerj                    |
| AmazonComprehendServiceRole-asdfasdf                             |
| AmazonComprehendServiceRole-categories                           |
| AmazonComprehendServiceRole-ClassifyProjects                     |
| AmazonSageMaker-ExecutionRole-20190123T172234                    |
| AmazonSageMaker-ExecutionRole-20240918T171879                    |
| AmazonSagemakerCanvasBedrockRole-20240918T171879                 |
| AmazonSageMakerCanvasEMRSExecutionAccess-20240918T171879         |
| AmazonSageMakerServiceCatalogProductsApiGatewayRole              |
| AmazonSageMakerServiceCatalogProductsCloudformationRole          |
| AmazonSageMakerServiceCatalogProductsCodeBuildRole               |
| AmazonSageMakerServiceCatalogProductsCodePipelineRole            |
| AmazonSageMakerServiceCatalogProductsEventsRole                  |
| AmazonSageMakerServiceCatalogProductsExecutionRole               |
| AmazonSageMakerServiceCatalogProductsFirehoseRole                |
| AmazonSageMakerServiceCatalogProductsGlueRole                    |
| AmazonSageMakerServiceCatalogProductsLambdaRole                  |
| AmazonSageMakerServiceCatalogProductsLaunchRole                  |
| AmazonSageMakerServiceCatalogProductsUseRole                     |
| AmazonTranslateServiceRole-localization                          |
| AmazonTranslateServiceRole-localizationasfasdf                   |
| AWSDeepLensGreengrassGroupRole                                   |
| AWSDeepLensGreengrassRole                                        |
| AWSDeepLensLambdaRole                                            |
| AWSDeepLensServiceRole                                           |
| AWSRoboMakerDeepRacer-15518159-LambdaExecutionRole-1U972HGKRIR1I |
| AWSRoboMakerDeepRacer-1551815998-SimulationJobRole-11N5TFQ2YCT73 |
| AWSServiceRoleForAmazonSageMakerNotebooks                        |
| AWSServiceRoleForRoboMaker                                       |
| ExecuteRoleMLWorkflow                                            |
| mla-sagemaker-role                                               |
| SageMaker-MLOpsEngineer                                          |

*** List Groups
#+BEGIN_SRC shell
  aws iam list-groups | jq -r '.Groups[].GroupName'
#+END_SRC

#+RESULTS:
| MachineLearning |
| Serverless      |

*** List Hosted Zones
#+BEGIN_SRC shell
  aws route53 list-hosted-zones | jq -r '.HostedZones[].Name'
#+END_SRC

#+RESULTS:
: watermid.com.

*** List Documents
#+BEGIN_SRC shell
  aws ssm list-documents | jq -r '.DocumentIdentifiers[].Name | select(
      contains("AI") or
      contains("ML") or
      contains("SageMaker") or
      contains("Comprehend") or
      contains("Rekognition") or
      contains("Textract") or
      contains("Polly") or
      contains("Transcribe") or
      contains("Translate") or
      contains("Bedrock") or
      contains("Inference") or
      contains("Prediction") or
      contains("MachineLearning")
  )'
#+END_SRC

#+RESULTS:
| AWS-DisableSageMakerNotebookRootAccess                 |
| AWSConformancePacks-OperationalBestPracticesforAIandML |

*** List Keys
#+BEGIN_SRC shell
  aws kms list-keys | jq -r '.Keys[].KeyId' | wc -l
#+END_SRC

#+RESULTS:
: 7

*** List Aliases
#+BEGIN_SRC shell
  aws kms list-aliases | jq -r '.Aliases[].AliasName' | wc -l 
#+END_SRC

#+RESULTS:
: 15

